Repository: masumrpg/budget_management_app
Catalog: lib/l10n/app_*.arb
Languages: id

# appTitle
source: Budget Management
id: Manajemen Anggaran

# searchHint
source: Search items or PIC...
id: Cari item atau PIC...

# notificationTitle
source: Test Notification
id: Notifikasi Uji Coba

# notificationBody
source: This is a test notification.
id: Ini adalah notifikasi uji coba.

# notificationsTooltip
source: Notifications
id: Notifikasi

# exportSuccess
source: Exported to {path}
id: Diekspor ke {path}

# exportTooltip
source: Export to Excel
id: Ekspor ke Excel

source: Switch to Light Mode
id: Ganti ke Mode Terang

source: Switch to Dark Mode
id: Ganti ke Mode Gelap

# changeYearTooltip
source: Change Year
id: Ganti Tahun

# viewReportsTooltip
source: View Reports
id: Lihat Laporan

# noItemsFound
source: No items found for {year}
id: Tidak ada item ditemukan untuk {year}

# tryAddingItems
source: Try adding items or adjusting your search
id: Coba tambahkan item atau sesuaikan pencarian Anda

source: Add Item
id: Tambah Item

# budgetManagementTitle
source: Budget Management {year}
id: Manajemen Anggaran {year}

# yearSelectionTitle
source: Select Year
id: Pilih Tahun

source: Enter Year
id: Masukkan Tahun

source: Select
id: Pilih

source: Cancel
id: Batal

source: Delete Item
id: Hapus Item

# deleteConfirmation
source: Are you sure you want to delete this item?
id: Apakah Anda yakin ingin menghapus item ini?

source: Delete
id: Hapus

source: Item Name
id: Nama Item

source: Planned Amount
id: Jumlah Direncanakan

# soNumber
source: SO No
id: No SO

source: PIC Name
id: Nama PIC

source: Description
id: Deskripsi

source: Actual Amount
id: Jumlah Aktual

source: Actions
id: Aksi

source: New Item
id: Item Baru

source: Save
id: Simpan

source: Please enter item name
id: Mohon masukkan nama item

source: Please enter planned amount
id: Mohon masukkan jumlah direncanakan

source: Please enter PIC name
id: Mohon masukkan nama PIC

source: Reports
id: Laporan

source: Total Budget
id: Total Anggaran

source: Total Used
id: Total Terpakai

source: Total Actual
id: Total Aktual

source: Remaining
id: Sisa

source: Budget Realization
id: Realisasi Anggaran

source: Expense Breakdown
id: Rincian Pengeluaran

source: Monthly Trend
id: Tren Bulanan

# noData
source: No data available
id: Tidak ada data tersedia

source: Dashboard
id: Dasbor

source: Select Budget Year
id: Pilih Tahun Anggaran

# selectBudgetYearTitle
source: Budget Management App
id: Aplikasi Manajemen Anggaran

# selectBudgetYearSubtitle
source: Please select the budget year to get started
id: Silakan pilih tahun anggaran untuk memulai

# budgetYearLabel
source: Budget Year
id: Tahun Anggaran

# budgetYearHint
source: Enter year (e.g., 2025)
id: Masukkan tahun (cth. 2025)

# pleaseEnterYear
source: Please enter a year
id: Mohon masukkan tahun

# pleaseEnterValidYear
source: Please enter a valid year
id: Mohon masukkan tahun yang valid

# continueToApp
source: Continue to Budget Management
id: Lanjutkan ke Manajemen Anggaran

source: Select Year for Report
id: Pilih Tahun untuk Laporan

# noBudgetData
source: No budget data available
id: Data anggaran tidak tersedia

# addBudgetItemsFirst
source: Add some budget items first
id: Tambahkan item anggaran terlebih dahulu

source: Report for {year}
id: Laporan untuk {year}

# reportTitle
source: Report {year}
id: Laporan {year}

# noBudgetDataForYear
source: No budget data for this year
id: Tidak ada data anggaran untuk tahun ini

# budgetReportTitle
source: Budget Report {year}
id: Laporan Anggaran {year}

# usagePercentage
source: Usage %
id: % Penggunaan

source: Summary
id: Ringkasan

source: Total Items
id: Total Item

source: Overall Usage
id: Penggunaan Keseluruhan

source: May
id: Mei

# august
source: Aug
id: Ags

# october
source: Oct
id: Okt

# december
source: Dec
id: Des

source: Confirm Delete
id: Konfirmasi Hapus

# deleteConfirmationMessage
source: Are you sure you want to delete "{itemName}"?
id: Apakah Anda yakin ingin menghapus "{itemName}"?

# budgetExhausted
source: Exhausted
id: Habis

source: Add New Budget Item
id: Tambah Item Anggaran Baru

# fillInDetails
source: Fill in the details below
id: Isi detail di bawah ini

source: Enter item name...
id: Masukkan nama item...

source: Enter PIC name...
id: Masukkan nama PIC...

# yearlyBudgetLabel
source: Yearly Budget
id: Anggaran Tahunan

# enterAmountHint
source: Enter amount...
id: Masukkan jumlah...

# frequencyLabel
source: Frequency (times a year)
id: Frekuensi (kali per tahun)

# frequencyHint
source: Enter frequency (1-12)...
id: Masukkan frekuensi (1-12)...

# pleaseEnterFrequency
source: Please enter a frequency
id: Mohon masukkan frekuensi

# pleaseEnterValidFrequency
source: Please enter a number between 1 and 12
id: Mohon masukkan angka antara 1 dan 12

source: Select Active Months:
id: Pilih Bulan Aktif:

# maxMonthsSelection
source: You can only select {frequency} months.
id: Anda hanya dapat memilih {frequency} bulan.

# selectExactlyMonths
source: Please select exactly {frequency} months.
id: Mohon pilih tepat {frequency} bulan.

source: Save Item
id: Simpan Item

source: Edit Budget Item
id: Edit Item Anggaran

# updateItemDetails
source: Update the item details below
id: Perbarui detail item di bawah ini

source: Update Item
id: Perbarui Item

# budgetLessThanUsed
source: Yearly budget cannot be less than total used amount ({amount})
id: Anggaran tahunan tidak boleh kurang dari total yang digunakan ({amount})

# updateAmountFor
source: Update Amount for {itemName}
id: Perbarui Jumlah untuk {itemName}

# monthLabel
source: Month: {month}
id: Bulan: {month}

source: Remaining Budget
id: Sisa Anggaran

# amountLabel
source: Amount
id: Jumlah

# pleaseEnterAmount
source: Please enter an amount
id: Mohon masukkan jumlah

# pleaseEnterValidNumber
source: Please enter a valid number
id: Mohon masukkan angka yang valid

# amountExceedsRemaining
source: Amount exceeds remaining budget
id: Jumlah melebihi sisa anggaran

source: Budget App
id: Aplikasi Anggaran
